Revit 2026 API

# SharedParameterApplicableRule Class

---

Tests whether an element supports a shared parameter.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBSharedParameterApplicableRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SharedParameterApplicableRule : FilterRule
```
```vb
Public Class SharedParameterApplicableRule
	Inherits FilterRule
```
```cpp
public ref class SharedParameterApplicableRule : public FilterRule
```
```fsharp
type SharedParameterApplicableRule =
    class
        inherit FilterRule
    end
```

The SharedParameterApplicableRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SharedParameterApplicableRule | Constructs an instance of SharedParameterApplicableRule. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |
|  | ParameterName | The name of the parameter that an element must support to pass this rule. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from FilterRule) |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. (Inherited from FilterRule) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. (Inherited from FilterRule) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace